       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST-KCBS010.
      ******************************************************************
      * システム名    ：テストプログラム
      * サブシステム名：
      * プログラム名  ：サブプログラムのスタブ
      * 作成日／作成者：2026年6月18日　小林健太郎
      * 変更日／変更者：
      *       変更内容：
      ******************************************************************
       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY KCBS010P.

       PROCEDURE DIVISION.
           DISPLAY "*** SYSTEM-DATE ***".

           MOVE "010101" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "010630" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "010930" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "990430" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "010631" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "011131" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "000229" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "020229" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "040229" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "030332" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "040931" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "050230" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "060100" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "070001" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "081301" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "0B0609" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "991C13" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "26042D" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

      *********8ケタ
           DISPLAY "8keta".

           MOVE "010101" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "010630" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "010930" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "990430" TO S010-DATE6.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "19010631" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20011131" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20000229" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20020229" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20040229" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "21000229" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20030332" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20040931" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20050230" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20060100" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20070001" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "20081301" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "A0090928" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "200B0609" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "19991C13" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           MOVE "2026042D" TO S010-DATE8.
           PERFORM CALL-CALCKCBS010-RTN.

           STOP RUN.

       CALL-CALCKCBS010-RTN SECTION.
           CALL "KCBS010" USING KCBS010-P1.
           DISPLAY S010-DATE8 " -> S010-RCD: " S010-RCD.
           DISPLAY " ".
           EXIT. 




       