      ********************************************************************
      *プログラム名：HELLO
      *機能         :メッセージを画面に表示する
      ******************************************************************** 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'HELLO, KOBAYSHI'.
           DISPLAY 'I like ice cream.'.
           STOP RUN.