       01  ITF-REC.
    3            03  EMP-NO            PIC X(04).
    4            03  EMP-NAME          PIC N(20).
    5            03  EMP-JOINED-DATE   PIC 9(08).
