      ******************************************************************
      * Copyright (c) 2026 システム技研株式会社
      * All Rights Reserved.
      *
      * 本ファイルの利用条件は LICENSE.materials に記載されています。
      * The terms and conditions for use of this file are described
      * in LICENSE.materials.
      ******************************************************************
      *    KCCMJUCHU: 受注マスタ
      ******************************************************************
           03  CMJUCHU-DATA-KBN           PIC  9(01).
           03  CMJUCHU-JUCHU-NO           PIC  9(04).
           03  CMJUCHU-JUCHU-DATE         PIC  X(06).
           03  CMJUCHU-SHOHIN-NO          PIC  X(05).
           03  CMJUCHU-SURYO              PIC  9(05).
